Autodesk.Revit.UI.Macros.ApplicationEntryPoint.AddinFolder
The full path to the Revit Macros module.
Remarks:  This path should be used instead of the .NET GetExecutingAssembly() result, because
the Macros module is loaded in such a way to make that result unreliable.

Autodesk.Revit.UI.Macros.ApplicationEntryPoint.OnShutdownEO
For Revit Macros internal use only.

Autodesk.Revit.UI.Macros.ApplicationEntryPoint.FinishInitializationEO
For Revit Macros internal use only.

Autodesk.Revit.UI.Macros.ApplicationEntryPoint.Initialize(System.Object,System.String)
For Revit Macros internal use only.

Autodesk.Revit.UI.Macros.ApplicationEntryPoint
For Revit Macros use only.